app/views/contestants/index.html.erb

<h4><%= contestant.id %>: <%= contestant.name %></h4>
    <% contestant.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" INNER JOIN "contestant_projects" ON "projects"."id" = "contestant_projects"."project_id" WHERE "contestant_projects"."contestant_id" = $1  [["contestant_id", 1]]